{
    "essays": [
        {
            "title": "Powerless Voices: Child Characters in American Films During Millennials’ Formative Years (1999-2012)",
            "date": "2017-12-13",
            "abstract": "This exploratory essay examines portrayals of children under 12 years old in American films from 1999 to 2012, a period corresponding to the formative adolescent and young adult years of the millennial generation. The analysis focuses on five commercially successful films targeted at adult audiences that feature children as significant supporting characters: _Pay it Forward_ (2000), _The Pursuit of Happyness_ (2006), _I am Sam_ (2001), _What Maisie Knew_ (2012), and _The Sixth Sense_ (1999). Through character analysis and examination of narrative structures, the essay identifies recurring patterns in how child characters function within these adult-focused narratives. Findings reveal that children consistently serve as symbolic devices—totems of hope, mirrors for adult self-reflection, and emotional outlets—rather than fully developed characters with independent agency. The analysis notes that films directed by women (_Pay it Forward_ and _I am Sam_) tend to create more complex child characters with greater narrative voice compared to those directed by men. Across all films examined, children’s powerlessness is explicitly highlighted through dialogue and plot structures, with adult characters maintaining control over children’s lives and voices. The essay observes that these cinematic representations reflect broader cultural dynamics in which children “are spoken for” rather than given authentic voice. While not establishing causal relationships, the paper suggests these patterns of representation during millennials’ formative years may offer insight into this generation’s complex relationship with traditional adult responsibilities and their resistance to conventional markers of maturity.",
            "url": "",
            "course": "FLM 1070",
            "school": "Salt Lake Community College",
            "tags": ["Film Studies", "Identity", "Social Justice"]
        },
        {
            "title": "Unresolved and Uncomfortable: _Do The Right Thing_ Refused the Racial Reconciliation of _In The Heat Of The Night_",
            "date": "2017-11-17",
            "abstract": "This comparative film analysis examines how Spike Lee’s portrayal of powerful Black characters and unresolved racial tension in Do The Right Thing (1989) created a fundamentally different audience experience than Norman Jewison’s In The Heat Of The Night (1967). Through analysis of camera techniques, character development, and narrative structure, the essay demonstrates that Lee’s use of low-angle shots empowered his Black characters, while Jewison’s eye-level framing of Virgil Tibbs maintained traditional power hierarchies. The examination reveals that Tibbs, despite being “the first significant black male cop in U.S. film history,” remains powerless through circumstance and dependent on white authority for survival. In contrast, Lee’s characters, particularly Mookie and Radio Raheem, maintain community dialogue and social agency despite economic limitations. The analysis shows that Jewison resolved racial tensions through friendship and mutual respect, providing closure that satisfied white audiences, while Lee deliberately left conflicts unresolved, forcing viewers to confront ongoing racial complexities. The essay incorporates audience reception research indicating that white viewers found Do The Right Thing uncomfortable and “pro-Black,” while In The Heat Of The Night allowed them to feel racism was being addressed and resolved. The research concludes that Lee’s filmmaking choices—combining empowered Black characters with persistent racial tensions—created an unprecedented cinematic experience that refused to provide the cathartic resolution white audiences expected from racial narratives.",
            "url": "",
            "course": "FLM 1070",
            "school": "Salt Lake Community College",
            "tags": ["Film Studies", "Social Justice", "Rhetoric"]
        },
        {
            "title": "Embracing Chaos: A Life Philosophy of Anti-Fragile Existence",
            "date": "2017-12-11",
            "abstract": "This philosophical essay explores the author’s life philosophy centered on the concept that chaos is fundamental to life’s existence and purpose. The author argues that life is ”anti-fragile” precisely because it is chaotic, challenging conventional views that position life as emerging from or transcending chaos. Drawing on scientific understanding of cellular processes and biological systems, the essay demonstrates how apparent biological order actually depends on molecular-level chaos, where proteins and ions move randomly yet create statistically inevitable outcomes. The author connects this biological chaos to broader cosmic processes, referencing Carl Sagan’s observation that humans are “made of starstuff” and positioning life as a cosmic force that fills emptiness like gas filling a vacuum. The essay examines how consciousness emerged from life’s chaotic processes, enabling humans to grasp cause and effect while remaining part of the unpredictable system. The author concludes that appreciating life’s inherent chaos liberates individuals from fear of failure or loss, advocating for following one’s heart without attachment to outcomes. This perspective leads to the author’s “Massively Transformative Purpose” and entrepreneurial ambitions, supported by references to contemporary technological capabilities for rapid innovation. The essay synthesizes insights from Michael Crichton’s Jurassic Park, Carl Sagan’s Cosmos, and Peter Diamandis’s Bold to construct a philosophy embracing chaos as life’s essential creative force rather than its adversary.",
            "url": "https://slcc.digication.com/rfugal/Interdisciplinary",
            "course": "LE 1350",
            "school": "Salt Lake Community College",
            "tags": ["Philosophy", "Interdisciplinary", "Identity"]
        },
        {
            "title": "Neurodiversity and the Common Core State Standards",
            "date": "2018",
            "abstract": "This educational research critique examines the Common Core State Standards’ emphasis on phonics-based reading instruction and challenges the underlying assumptions about foundational reading skills. The author argues that the 1998 National Research Council’s definition of reading as “getting meaning from print, using knowledge about the written alphabet and about the sound structure of oral language” inadequately represents the diversity of effective reading pathways and marginalizes neurodivergent learners. The analysis demonstrates that forty-two states have adopted Common Core standards heavily weighted toward phonological awareness and phonics skills, with only minimal recognition of sight word reading despite research showing that fluent reading relies on automatic word recognition rather than phonemic decoding. Evidence presented includes the case of Christina Hartmann, a profoundly deaf reader who learned to read without access to oral language’s sound structure, and twin studies by van Bergen et al. (2018) showing that reading ability drives print exposure rather than vice versa. The document analyzes Anderson’s (1988) data revealing a 46-fold difference in reading volume between high and low performing students, challenging the assumption that increased print exposure improves reading ability. Current reading instruction fails approximately two-thirds of students who test below proficiency benchmarks, yet the educational establishment continues to prescribe uniform phonics-based methods. The author proposes modifying Common Core standard ELA-LITERACY.RF.K.3.D to recognize words as visual objects by changing “identifying the sounds of the letters that differ” to identifying the letters that differ” when distinguishing between orthographically similar words. This modification acknowledges neurodiversity in reading acquisition while maintaining letter-wise attention benefits for word recognition development.",
            "url": "http://www.sara.ai/ebook/common-core.html",
            "course": "ENGL 2010",
            "school": "Salt Lake Community College",
            "tags": ["Education", "Neurodiversity", "Literacy"]
        },
        {
            "title": "To Get More Children Reading, Let Them Experiment Through Play",
            "date": "2018",
            "abstract": "This essay examines the persistent literacy crisis affecting 10-15 million children in the United States, analyzing the disconnect between traditional phonemic decoding instruction and developmental readiness for reading acquisition. The author synthesizes research on childhood cognitive development, attention patterns, and educational outcomes to challenge current goal-oriented reading instruction paradigms. Key findings reveal that despite theoretical capability to teach phonemic decoding in 50-100 hours over four years of classroom instruction, 64% of students read below proficiency levels, with 25% remaining at or below fourth-grade reading levels by eighth grade. The analysis contrasts children’s “lantern consciousness” (broad, exploratory attention) with adults’ “spotlight consciousness” (focused, goal-directed attention), drawing on neurobiological research by Alison Gopnik and others. Evidence demonstrates that academic preschools providing teacher-led literacy instruction produce initial gains that disappear by fourth grade, while play-based preschools yield superior long-term academic performance and social-emotional outcomes. Twenty-year longitudinal studies indicate adults from academic preschools show increased rates of emotional impairment, relationship difficulties, and criminal behavior. The author argues that current evidence-based phonemic decoding instruction, while theoretically sound, fails to accommodate developmental appropriateness and may cause psychological harm when imposed before cognitive readiness. Alternative approaches emphasizing reading aloud, natural conversation, and exploratory play are presented as more developmentally appropriate methods for fostering literacy development. The essay concludes that closing the reading instruction efficacy gap requires loosening goal-oriented milestones in favor of play-based exploration that aligns with natural brain development patterns, challenging practitioners to adopt first, do no harm” principles in early literacy education.",
            "url": "https://www.sara.ai/ebook/play.html",
            "course": "ENGL 2010",
            "school": "Salt Lake Community College",
            "tags": ["Education", "Literacy", "Neurodiversity"]
        },
        {
            "title": "Mastering Language",
            "date": "2018-02-20",
            "abstract": "This personal essay explores the challenges of language acquisition and literacy from the perspective of an American missionary learning Chinese in Taiwan. The author examines his lifelong struggle with language processing, beginning with below-proficient reading performance in fourth grade and extending to his experience as an adult learner confronting Chinese characters in an immersive environment. The narrative describes the author’s systematic approach to learning Chinese through intensive daily study, averaging 3-4 hours per day over twelve months, ultimately achieving recognition of 3,000 characters. The essay uses metaphorical language comparing linguistic challenges to natural phenomena, particularly snow imagery, to illustrate the ephemeral nature of language acquisition for individuals with learning differences. The work provides insight into the psychological and practical aspects of adult second-language learning, the experience of functional illiteracy in a foreign culture, and the relationship between etymology and deeper language comprehension. The author reflects on the contrast between his appreciation for Chinese linguistic structure and his ongoing difficulties with language retention and production.",
            "url": "https://medium.com/@rfugal/mastering-language-234240d2fdd2",
            "course": "ENGL 2010",
            "school": "Salt Lake Community College",
            "tags": ["Identity", "Neurodiversity", "Literacy"]
        },
        {
            "title": "Struggle",
            "date": "2018-02-20",
            "abstract": "This personal narrative examines the reading challenges and educational journey of a homeschooled individual with suspected dyslexia through the lens of family experience and literacy assessment practices. The author documents his brother Greg’s struggle with learning to read despite normal intelligence, using a nonsense word fluency test to illustrate persistent reading difficulties. The case study traces Greg’s educational path from early reading struggles at age six through successful completion of a bachelor’s degree in Exercise Science and entry into a Doctor of Physical Therapy program. Key findings include the protective benefits of homeschooling against peer comparison and stigmatization, the persistence of dyslexic traits into adulthood despite functional literacy achievement, and the development of compensatory strategies such as reliance on auditory learning over textbook reading. The narrative challenges deficit-based conceptualizations of dyslexia by highlighting divergent cognitive strengths, including enhanced imagination and spatial processing abilities. Educational implications emphasize the importance of individualized pacing, reduced emphasis on speed-based assessments, and recognition of neurodiversity as a source of cognitive advantage rather than disability. The case demonstrates that reading difficulties need not preclude academic success when appropriate accommodations and alternative learning strategies are employed.",
            "url": "https://medium.com/@rfugal/i-recently-asked-my-little-brother-who-has-struggled-with-reading-to-read-this-word-be773856c642",
            "course": "ENGL 2010",
            "school": "Salt Lake Community College",
            "tags": ["Education", "Neurodiversity", "Identity"]
        },
        {
            "title": "On Pueblo Lands and Mormon Rhetoric",
            "date": "2019-05-08",
            "abstract": "This essay examines the disconnect between Mormon settlement narratives and indigenous historical reality through the author’s comparative analysis of growing up in Santa Fe, New Mexico, and visiting Utah’s “This is The Place” monument. The author explores how Mormon rhetoric portrays the Great Basin as uninhabited wilderness awaiting religious settlement, contrasting this with the visible indigenous presence and colonial contestation evident on Pueblo lands. Through close reading of hymns, monument inscriptions, and visitor center presentations, the analysis reveals how Mormon settlement mythology employs Manifest Destiny language, depicting the land itself as welcoming Mormon pioneers while systematically erasing or minimizing indigenous peoples’ millennia-long presence and the violence of dispossession. The study demonstrates how the This is The Place monument, despite its academic veneer, functions as religious rhetoric that celebrates White settlement while reducing Native American presence to brief mentions of nomadic hunters and gatherers” and “conflict with some native peoples.” The author argues that unlike the contested colonial narratives visible throughout Santa Fe, Utah’s Mormon heritage sites perpetuate a sanitized version of settlement history that obscures the devastating impact of colonization on Nuche-Neme peoples. The essay concludes by calling for recognition of historical responsibility and challenging the “All is well” rhetoric that characterizes Mormon settlement narratives when applied to lands with complex indigenous histories.",
            "url": "https://rfugal.medium.com/on-pueblo-lands-and-mormon-rhetoric-22d6f6b16df",
            "course": "WRTG 4050",
            "school": "University of Utah",
            "tags": ["Indigenous Studies", "Colonial Studies", "Rhetoric"]
        },
        {
            "title": "Well Read",
            "date": "2018-06-18",
            "abstract": "This personal essay examines the author’s lifelong struggle with reading comprehension and sustained attention, drawing parallels between “highway hypnosis” while driving and similar attention lapses experienced while reading. The author reflects on childhood reading experiences, from easily completing picture books to struggling with longer texts despite genuine interest, and explores potential connections to undiagnosed attention deficit disorder or dyslexia. Through observations of his children’s contrasting literacy development—particularly his daughter’s voracious reading appetite and his son’s initial reading difficulties—the author gains insights into neurodiversity and varied learning approaches. The narrative weaves together themes of educational methodology, parental anxiety about children’s academic success, and the author’s evolving understanding of different cognitive abilities. The essay concludes with the author’s renewed commitment to becoming “well-read” and supporting primary literacy development in others. Written in a stream-of-consciousness style that mirrors the attention challenges described, the piece offers a candid exploration of learning differences and the complex relationship between reading ability and intellectual capability.",
            "url": "https://rfugal.medium.com/well-read-2f23d614645d",
            "course": "WRTG 3030",
            "school": "University of Utah",
            "tags": ["Identity", "Neurodiversity", "Literacy"]
        },
        {
            "title": "Full Humanity",
            "date": "2019-12-08",
            "abstract": "This essay examines the rhetorical construction of racial identity and dehumanization through analysis of contemporary debates surrounding Zionism and anti-Zionism on American university campuses. Using Blake Flayton’s 2019 New York Times opinion piece as a primary case study, the author explores how competing narratives of victimization and identity politics shape discourse around the Israel-Palestine conflict. The analysis traces historical patterns of dehumanizing rhetoric from Wilhelm Adolf Marr’s 19th-century antisemitic theories through modern applications, drawing parallels between Zionist settler-colonialism and Mormon colonization of Utah territory. The essay argues that both pro-Israel and pro-Palestine advocates employ identity-based rhetorical strategies that risk perpetuating cycles of dehumanization, with Zionist groups invoking antisemitic tropes to delegitimize criticism while anti-Zionist movements face accusations of antisemitism that silence legitimate political opposition. Through examination of campus activism, particularly the Boycott, Divest, and Sanction (BDS) movement, the author demonstrates how rhetorical constructions of race and identity serve to rationalize exclusion and maintain hegemonic power structures. The essay concludes by advocating for a decolonial approach that “reclaims full humanity” for all parties by acknowledging the capacity of all peoples—including historically oppressed groups—to participate in oppressive systems, thereby moving beyond victim-perpetrator narratives toward more complex understandings of power and identity in contemporary political discourse.",
            "url": "https://rfugal.medium.com/full-humanity-955c25b20df7",
            "course": "WRTG 3875",
            "school": "University of Utah",
            "tags": ["Social Justice", "Rhetoric", "Colonial Studies"]
        },
        {
            "title": "Through a Photographic Lens: Visual Composition in Byron’s ’She Walks in Beauty’",
            "date": "2018",
            "abstract": "This explication essay analyzes Lord Byron’s poem “She Walks in Beauty” through the lens of photographic composition techniques, arguing that Byron employs technical elements of photography—framing, lighting, contrast, texture, focus, and light quality—to create a powerful portrait of his subject. The analysis examines how Byron establishes compositional framing in the opening line, develops the central “dark and bright” contrast through comparison to starry night skies, and manipulates lighting quality to create what the author terms “tender light” that “heaven to gaudy day denies.” Through close reading of specific lines and consultation of Webster’s 1828 Dictionary for period-appropriate definitions, the essay demonstrates how Byron uses language to describe fine adjustments in lighting and shadow, creating visual effects analogous to professional photography techniques. The analysis traces the poem’s progressive focus from wide composition to intimate character study, showing how Byron captures the subject’s inner qualities through external visual elements. The essay concludes that despite photography’s infancy in 1814, Byron’s poetic technique illustrates the fundamental power of visual composition to convey both physical beauty and moral character, suggesting an intuitive understanding of principles that would later define photographic artistry.",
            "url": "",
            "course": "ENGL 2600",
            "school": "Salt Lake Community College",
            "tags": ["Rhetoric", "Interdisciplinary", "Poetry"]
        },
        {
            "title": "The Spotless Mantle of Judgment: Reconsidering Snow in ’The Outcasts of Poker Flat",
            "date": "2018-04-10",
            "abstract": "This analysis examines the symbolic function of snow in Bret Harte’s The Outcasts of Poker Flat,” challenging conventional interpretations that view the snow as cleansing or merciful. Through close textual analysis and examination of narrative technique, the study argues that the snow symbolizes the “pious abandon” and hypocritical moral judgement of Poker Flat’s citizens who exile four outcasts to their deaths. The methodology involves analyzing shifts in narrative perspective, ironic commentary, and biblical allusions to demonstrate how Harte employs the snow as a “Trojan bully” that executes the town’s callous sentence. The analysis reveals that Poker Flat’s “virtuous reaction” is itself lawless and reactive, complicit in the sins it condemns, particularly in the case of gambler John Oakhurst whose only crime was winning money the town had lost. Results show that Harte uses narrative distance and perspective shifts to build reader sympathy for the outcasts while maintaining ironic detachment from Poker Flat’s moral pretensions. The study concludes that the snow represents not divine mercy but human hypocrisy, serving as the instrument of an unjust community’s judgment that ultimately destroys innocence itself in the character of Piney Wood. The analysis situates Harte within the tradition of American literary humorists who employ irony and biblical symbolism to critique social moral failures, demonstrating how environmental symbolism can embody community character rather than natural or divine forces.",
            "url": "",
            "course": "ENGL 2600",
            "school": "Salt Lake Community College",
            "tags": ["Rhetoric", "Social Justice", "Environmental"]
        },
        {
            "title": "The Conversation Risk: Writer-Reader Dynamics in Literary Interpretation",
            "date": "2018-03-16",
            "abstract": "This essay explores the dynamic relationship between writers and readers in literary communication, examining how readers actively reconstruct textual meaning through their personal experiences and cultural contexts. The author analyzes the collaborative nature of reading through close examination of works by Angela Carter, Langston Hughes, Walt Whitman, and Allen Ginsberg, demonstrating how readers inevitably “re-write” texts by bringing their own histories and perspectives to the interpretive process. Using Hughes’s “Theme for English B” and Whitman’s “When I Heard the Learn’d Astronomer,” the essay investigates the risks writers face when attempting cross-cultural communication and the potential for misunderstanding when shared experience is limited. The analysis extends to Susan Blackmore’s concept of memetic evolution, positioning reader response as a driving force in cultural evolution through the variation, heredity, and selection of reproducible ideas. The author illustrates these theoretical concepts through personal reading experiences with Ginsberg’s “A Supermarket in California,” showing how expanded knowledge and research enable deeper textual engagement. The work argues that while perfect authorial-reader communication may be impossible, the ongoing dialogue between text and reader generates meaningful cultural evolution and understanding.",
            "url": "",
            "course": "ENGL 2600",
            "school": "Salt Lake Community College",
            "tags": ["Rhetoric", "Writing Studies", "Interdisciplinary"]
        },
        {
            "title": "Five Lives, One Nation: The Contradictions of American Civilization Through Biographical Lens",
            "date": "2018-04-10",
            "abstract": "This essay examines the complex and contradictory nature of American civilization through the biographical lens of five pivotal historical figures spanning 317 years of American history: Popé, Benjamin Franklin, Tenskwatawa, John Muir, and Henry Ford. The author employs a comparative biographical methodology to demonstrate how these individuals embody the fundamental tensions and conflicts that have shaped American society since the 16th century, including colonization versus resistance, exploitation versus preservation, and progress versus conservation. Popé (c. 1630-1680s) led the most successful Native American resistance to European colonization through the 1680 Pueblo Revolt, while Franklin (1706-1790) represented both British colonial ideals and American revolutionary spirit, simultaneously advocating for westward expansion that displaced indigenous peoples. Tenskwatawa (1775-1836) continued the tradition of Native American resistance through prophetic calls for cultural revival against U.S. expansion policies, while Muir (1838-1914) championed environmental preservation through the Sierra Club and National Parks movement. Ford (1863-1947) epitomized industrial modernization through mass production techniques and the democratization of automobile ownership. The study concludes that these five figures collectively illustrate that American civilization cannot be understood as a unified narrative of progress, but rather as a complex amalgamation of competing values, ongoing struggles, and contradictory impulses toward both exploitation and preservation that continue to define American society. The biographical approach demonstrates how individual lives reflect broader historical tensions between indigenous rights, colonial expansion, environmental stewardship, and industrial development.",
            "url": "",
            "course": "HIST 1700",
            "school": "Salt Lake Community College",
            "tags": ["Biography", "Indigenous Studies", "Environmental"]
        },
        {
            "title": "ROMANIZED",
            "date": "2018-08-07",
            "abstract": "This historical poem chronicles the repeated mispronunciation and misspelling of Sacagawea’s name by Lewis and Clark during the 1805-1806 expedition, using actual journal entries to document the violence of colonial inscription. The work contrasts the Shoshone girl’s multiple tribal identities—agaidika (salmon eaters), hiraacá (willow people)—with her various colonial designations (Janey, bird woman, interpreter) to illustrate how European romanization functions as both arrogance and violence. Through the progression of failed attempts to capture her name in writing, the poem demonstrates how colonial documentation substitutes inscription for actual knowledge while transforming indigenous individuals into symbols of white conquest.",
            "url": "",
            "course": "ENGL 3780",
            "school": "University of Utah",
            "tags": ["Poetry", "Indigenous Studies", "Colonial Studies"]
        },
        {
            "title": "witaèmi",
            "date": "2018-04-10",
            "abstract": "This poem explores the Lenape concept of witaèmi (stay with me) as a framework for understanding community formation and cultural conflict. Through fragmented imagery and bilingual terminology, the work examines how indigenous and colonial peoples create separate spaces while occupying the same land, contrasting Lenape concepts of place (kithane) with British colonial claims (de La Warr). The poem questions why diversity leads to conflict rather than harmony, tracing the historical trajectory from initial cultural contact through westward expansion while advocating for community perseverance and the possibility of staying together in difference (witaeminèn).",
            "url": "",
            "course": "ENGL 2600",
            "school": "Salt Lake Community College",
            "tags": ["Poetry", "Indigenous Studies", "Colonial Studies"]
        },
        {
            "title": "Staying with: the voices and knowledges of indigenous peoples",
            "date": "2018-08-12",
            "abstract": "This essay argues that the voices and knowledges of indigenous peoples matter because individuals with unheard voices are regarded as less-than-human within the power systems of colonial conquest, pushing marginalized populations into obscurity and separating humanity when unity in difference is essential. Through analysis of postcolonial literary theory, examination of Lenape linguistic concepts, and creative reflection on alternative historical narratives, the author demonstrates how Eurocentric perspectives have systematically marginalized indigenous subjectivities and epistemologies. The study employs the Lenape concept of _witaèmi_ (to stay with) as a framework for understanding togetherness-in-difference, contrasting this with colonial paradigms that demand assimilation or homogenization. Drawing on scholarship by Suvir Kaul, Felicity Nussbaum, and LuMing Mao, the essay traces how eighteenth-century European colonial discourse constructed narratives of indigenous inferiority while presenting European imperial expansion as civilizing mission. The author critiques how imperial history functions as false knowledge, using examples from Pacific navigation and the misrepresentation of Sacagawea to illustrate how written European accounts substituted for actual indigenous knowledge. The paper concludes that decolonizing contemporary power structures requires the accumulation of indigenous knowledges, repetition of indigenous stories, and representation of indigenous voices to create new paradigms that allow for sustainable coexistence in difference rather than continued hegemonic domination.",
            "url": "",
            "course": "ENGL 3780",
            "school": "University of Utah",
            "tags": ["Indigenous Studies", "Colonial Studies", "Rhetoric"]
        },
        {
            "title": "Personal Passion, Impersonal Knowledge: Rhetorical Conventions in Educational Psychology Journals",
            "date": "2018-07-03",
            "abstract": "This study examines the rhetorical conventions of peer-reviewed academic journal articles in educational psychology, specifically focusing on research about orthographic learning processes. Through analysis of four representative articles from journals including the Journal of Child Psychology and Psychiatry and Scientific Studies of Reading, the author investigates how this discourse community balances objective scholarly standards with personal academic engagement. The analysis reveals that educational psychology researchers employ highly specialized terminology that requires extensive definitional work, with authors dedicating substantial portions of their introductions to literature reviews that both define key concepts and establish theoretical frameworks. The study identifies a distinctive rhetorical pattern where authors use personal pronouns (“we investigated,” “we hypothesized”) in introductory sections to establish their research decisions and purposes, then shift to impersonal, objective language in methodology and results sections that emphasize statistical analysis and passive voice constructions. This code-switching between personal and impersonal registers reflects the discourse community’s dual commitment to individual scholarly creativity in research design and impersonal objectivity in knowledge contribution. The findings demonstrate that while this academic community prioritizes objective, statistical contributions to scientific knowledge—evidenced through APA citation formats emphasizing temporal progression and extensive use of descriptive statistics—it simultaneously values the personal intellectual work required to frame studies and make methodological decisions. The analysis concludes that educational psychology discourse strategically employs both personal engagement and impersonal objectivity to strengthen the credibility and impact of scholarly contributions to reading research.",
            "url": "",
            "course": "WRTG 3020",
            "school": "University of Utah",
            "tags": ["Rhetoric", "Writing Studies", "Methodology"]
        },
        {
            "title": "Theory of Writing",
            "date": "2018-08-03",
            "abstract": "This reflective essay examines the evolution of a writer’s understanding of effective communication through personal and academic experience. The author traces their development from early career writing focused on conveying meaning to later work requiring emotional appeal and value-based persuasion in sales and customer management roles. A pivotal experience attempting to advocate for changes in children’s literacy education through business plans and grant applications revealed the ineffectiveness of their initial approaches, leading to experimental use of narrative fiction as a communication vehicle. Through enrollment in WRTG 3020 as a Writing Studies Scholar, the author constructed new theoretical knowledge about writing as communicative action, distinguishing between effective and ineffective writing based on purpose realization. Key insights include recognition of writing as both social action (conveying meaning, calling audiences to change) and individual action (knowledge construction through reflection), the importance of intentional craft over transcription of inner dialogue, and the necessity of combining critical analysis with practical application for writer development. The iterative revision process of articulating personal writing theory contributed significantly to self-discovery and learning. The author acknowledges continued uncertainty about the field of writing studies while expressing increased confidence as a writer and commitment to applying these insights in professional contexts.",
            "url": "",
            "course": "WRTG 3020",
            "school": "University of Utah",
            "tags": ["Writing Studies", "Rhetoric", "Identity"]
        },
        {
            "title": "On Dropping Out",
            "date": "2018-07-16",
            "abstract": "This personal narrative examines the experience of a college dropout who achieved professional success without completing a bachelor’s degree, challenging conventional assumptions about educational failure and economic necessity. The author traces his academic journey from 2001-2015, documenting two separate withdrawals from Brigham Young University due to financial constraints, emotional turmoil, and changing life circumstances including marriage and parenthood. Through detailed analysis of personal decisions against the backdrop of rising student debt and economic recession, the essay demonstrates how dropout decisions often reflect rational cost-benefit calculations rather than personal failure. The author documents professional advancement in engineering despite lacking formal credentials, earning upper-middle-class income while simultaneously facing systematic employment discrimination due to degree requirements. Drawing on scholarly works by Vincent Tinto and Sara Goldrick-Rab, the narrative contextualizes individual experience within broader institutional and economic forces affecting student retention. The essay concludes with the author’s eventual completion of an associate degree at Salt Lake Community College, revealing both personal growth and systemic barriers that disadvantage non-degree holders regardless of competence or experience. The work argues that educational institutions and employers overvalue formal credentials while undervaluing practical skills and experience, particularly impacting demographic groups with fewer resources to persist through financial hardship. This counter-narrative to typical dropout discourse suggests that some educational departures represent successful adaptation to economic realities rather than individual inadequacy, while acknowledging the continuing social and professional costs of non-completion in credential-dependent employment markets.",
            "url": "",
            "course": "WRTG 3030",
            "school": "University of Utah",
            "tags": ["Education", "Identity", "Social Justice"]
        },
        {
            "title": "Writing Dimensionally",
            "date": "2018-10-01",
            "abstract": "This essay challenges Stephen Roger Fisher’s definition of “complete” writing as systems that can linearly encode articulate speech, arguing instead that writing systems possess unique affordances not found in spoken language. Using Andrew Jones’s concept of material culture as “devices for storing memory in extrabodily form,” the author examines how non-phonological writing systems create knowledge through dimensional and spatial representation rather than linear encoding. The analysis employs examples from scientific notation, particularly chemical formulas and skeletal molecular diagrams, to demonstrate how symbolic writing systems communicate complex information that cannot be effectively conveyed through speech alone. Through personal literacy narratives and autoethnographic reflection, the author reveals how dimensional thinking and spatial cognition can be privileged over linear linguistic processing. The essay traces the development of Chinese writing (字) from its legendary origins 46 centuries ago through its systematization in the 2nd century etymological dictionary 說文解字, demonstrating how this non-phonological system has continuously influenced spoken Chinese while maintaining its symbolic integrity. The analysis reveals that writing functions as a multi-dimensional material technology that extends human cognition beyond the temporal constraints of threaded dialogue, enabling knowledge construction through spatial relationships and symbolic representation. The author concludes that privileging phonological writing systems perpetuates power dynamics that marginalize alternative ways of knowing, and that recognizing writing’s dimensional affordances validates diverse cognitive approaches to meaning-making and knowledge construction.",
            "url": "https://rfugal-misc.s3.amazonaws.com/Writing+Dimensionally_Fugal_Reflection+Essay_Draft6.pdf",
            "course": "WRTG 3870",
            "school": "University of Utah",
            "tags": ["Writing Studies", "Neurodiversity", "Interdisciplinary"]
        },
        {
            "title": "@SaveBearsEars",
            "date": "2019-05-01",
            "abstract": "This essay examines how Native American tribes employed social media advocacy to secure federal protection for Bears Ears National Monument, analyzing the intersection of Indigenous sovereignty, digital activism, and public land policy. Through textual analysis of hundreds of tweets from @savebearsears and examination of legislative documents, coalition statements, and media coverage, the study traces the Bears Ears Inter-Tribal Coalition’s strategic use of Twitter from 2015-2019 to build support for monument designation. The analysis reveals how five tribal governments—the Hopi Tribe, Navajo Nation, Ute Mountain Ute Tribe, Pueblo of Zuni, and Ute Indian Tribe—overcame internal disputes to present a unified digital voice emphasizing the sacred nature of ancestral lands and the religious freedom implications of land protection. The coalition’s social media strategy effectively countered local opposition from San Juan County officials and Utah state legislators who framed the debate around economic development, multiple land use, and state control over federal lands. Results demonstrate that @savebearsears successfully employed visual storytelling, strategic hashtag campaigns (#StandWithBearsEars, #MonumentsForAll, #HonorTribes), and educational content to broaden understanding of Indigenous land-based religious practices beyond conventional Western concepts of sacred space. The study concludes that digital platforms enabled Native advocates to maintain narrative control while building diverse coalitions, ultimately contributing to the monument’s initial 1.35 million-acre designation in December 2016, though subsequent political reversals highlight ongoing tensions between Indigenous sovereignty and extractive economic interests in public land management.",
            "url": "",
            "course": "WRTG 4050",
            "school": "University of Utah",
            "tags": ["Indigenous Studies", "Environmental", "Technology"]
        },
        {
            "title": "Embodied Agency",
            "date": "2019-09-29",
            "abstract": "This autoethnographic essay examines the author’s visceral reaction to classical rhetorical theories, particularly Plato’s critique of writing in Phaedrus, through the lens of embodied agency and decolonial rhetoric. Drawing from personal experience as a non-normative language user who relies on writing for identity performance and agency, the author challenges the mind/body duality inherent in classical rhetoric from Plato, Socrates, Gorgias, and Aristotle. The essay argues that these foundational rhetorical theories establish a colonial framework that dehumanizes those who cannot defend themselves through articulate speech, positioning them as subjects to be ruled rather than agents with their own forms of communication. Through analysis of key passages from Gorgias and Phaedrus, the author demonstrates how classical rhetoric’s privileging of oral dialectic creates hierarchical power structures that exclude embodied ways of knowing and communicating. The essay concludes by advocating for recognition of embodied rhetoric and decolonial approaches that acknowledge the agency of marginalized voices, challenging the normative assumption that mastery of traditional rhetorical forms determines one’s capacity for rational thought and human dignity.",
            "url": "https://rfugal-misc.s3.amazonaws.com/Embodied+Agency.pdf",
            "course": "WRTG 3875",
            "school": "University of Utah",
            "tags": ["Rhetoric", "Identity", "Neurodiversity"]
        },
        {
            "title": "Appeals of a New Deal: Derided, Ridiculed, and Green",
            "date": "2019-11-03",
            "abstract": "This rhetorical analysis examines how House Resolution 109 (HR109), commonly known as the Green New Deal, succeeded in transforming climate discourse despite widespread criticism and political opposition. Using M. Jimmie Killingsworth’s framework of appeals in modern rhetoric, the study analyzes the document’s strategic use of rhetorical devices to build consensus and galvanize climate activism. The methodology involves close textual analysis of HR109’s language, structure, and rhetorical strategies, contextualized within the broader political climate of 2019 and the rise of the Sunrise Movement. The analysis reveals that HR109 effectively employs multiple rhetorical appeals including authority (IPCC and National Climate Assessment reports), evidence (observed climate impacts), body (threats to human life and health), time (urgency of climate action), place (U.S. responsibility and local impacts), race and gender (systemic injustices), and narrative (crisis framework). The resolution’s rhetorical power stems from its integration of three key concepts: just transition, systemic injustices, and protection of frontline and vulnerable communities. Despite being politically “dead on arrival” and lacking legislative detail, HR109 successfully shifted national climate discourse, influenced all major Democratic presidential candidates in 2020, and shaped a generation of climate activism. The study concludes that the document’s rhetorical effectiveness lies not in its legislative viability but in its ability to create broad appeal through comprehensive inclusion of diverse communities and concerns, demonstrating how aspirational policy documents can function as powerful consensus-building tools in social movements.",
            "url": "",
            "course": "WRTG 3875",
            "school": "University of Utah",
            "tags": ["Rhetoric", "Environmental", "Social Justice"]
        },
        {
            "title": "Scrum as Genre within a Discourse Community",
            "date": "2019-10-30",
            "abstract": "This essay examines Scrum, the widely-used agile project management framework, through the theoretical lens of rhetorical genre studies, arguing that Scrum functions as a genre that performs essential social and cultural work within software development discourse communities. Drawing on Miller’s definition of genre as “typified rhetorical actions based in recurrent situations” and Bazerman’s characterization of genres as “forms of life” and “frames for social action,” the analysis demonstrates how Scrum’s prescribed roles, events, and artifacts constitute typified social actions that shape team identity and enable dynamic coordination. The study traces Scrum’s historical development from Kraut and Streeter’s 1995 identification of coordination challenges in large software projects through its formalization by Schwaber and Sutherland, positioning Scrum as a response to the need for “nurturing informal communication procedures” while maintaining organizational agility. Through discourse analysis of The Scrum Guide v6, the essay reveals a significant gap between Scrum’s social functions and its technical presentation, finding minimal emphasis on crucial terms like “social,” “culture,” “identity,” and “informal communication” despite research indicating that successful Scrum implementation requires substantial social and cultural transformation. The analysis suggests that viewing Scrum as genre rather than merely as framework or methodology could address documented implementation challenges by foregrounding the social knowledge construction and cultural shifts that enable agile coordination. This genre-based understanding has implications for Scrum implementation across industries, supporting its expansion beyond software development into diverse collaborative environments where teams must coordinate complex, adaptive work while maintaining flexibility and responsiveness to uncertainty.",
            "url": "https://rfugal-misc.s3.amazonaws.com/Scrum+as+Genre+within+a+Discourse+Community.pdf",
            "course": "WRTG 3830",
            "school": "University of Utah",
            "tags": ["Organizational", "Rhetoric", "Technology"]
        },
        {
            "title": "Writing and Rhetoric Studies Portfolio",
            "date": "2020-04-21",
            "abstract": "This portfolio reflection documents a neuroatypical student’s academic journey through the University of Utah’s Writing and Rhetoric Studies program, examining the intersection of disability, identity, and scholarly development. The author explores how nonlinear, multimodal thinking patterns simultaneously challenge and enhance academic writing practices, positioning neuroatypicality as both “stumbling block” and strength within traditional discourse communities. The reflection analyzes five portfolio essays that demonstrate mastery of program learning outcomes: “Embodied Agency” (Histories, Geographies, and Theories), which critically examines Greco-Roman-Western rhetorical traditions through crip critical discourse analysis; “Full Humanity” (Everyday Writing and Rhetorical Practices), exploring Zionism within Utah’s cultural-political-religious context; “Writing Dimensionally” (Rhetorical Competencies), investigating multimodal affordances of material literacies; “On Pueblo Lands and Mormon Rhetoric” (Rhetorical Action), examining coloniality of Mormon settlement through decolonial rhetoric; and “Scrum as Genre in a Discourse Community” (Information Literacies), analyzing project management practices through rhetorical analysis. The portfolio demonstrates knowledge transfer across multiple courses while addressing accessibility through audio recordings of each essay. The author’s evolution from struggling with traditional academic writing to identifying as a writing studies scholar illustrates how disability perspectives can contribute to discourse community knowledge-making. The reflection reveals writing studies education’s capacity to transform understanding of rhetorical competence beyond normative expectations, particularly for students whose cognitive processes challenge conventional academic literacies.",
            "url": "https://rfugal-misc.s3.amazonaws.com/Portfolio+Reflection.pdf",
            "course": "WRTG 5990",
            "school": "University of Utah",
            "tags": ["Writing Studies", "Neurodiversity", "Identity"]
        },
        {
            "title": "Sociocognitive Shadows: Analyzing technology-mediated word recognition in more-than-human learning ecologies",
            "date": "2024-12-16",
            "abstract": "This paper explores the concept of “sociocognitive shadows” as a framework for understanding language and meaning-making in technology-mediated and more-than-human learning ecologies. Integrating Gee’s (2001) sociocognitive perspectives on language with Barsalou’s (1999) perceptual symbol systems, the paper examines how meaning emerges. Through a post-humanism lens, it critiques traditional views of literacy as an intra-personal cognitive skill, arguing instead for a relational understanding where meaning resides in the interstitial (between-minds) hyperspace of sociocognitive interactions. Observations from an immersive reading webapp prototype underscore the role of material, embodied, and ecological factors in literacy development. The analysis highlights the pedagogical potential of rethinking literacy as distributed across human and nonhuman assemblages, challenging dominant ideologies of individualism in education.",
            "url": "",
            "course": "ELTL 700",
            "school": "University at Albany, SUNY",
            "tags": ["Technology", "Literacy", "Interdisciplinary"]
        },
        {
            "title": "Tracing movements of psychosocial safety practices in small organizations: a transliteracies ethnography of intervention uptake in upstate New York",
            "date": "2024-11-08",
            "abstract": "Moving leaders of small organizations (SOs) to action on improving psychosocial safety climate (PSC) and managing psychosocial risks is a monumental challenge, particularly given their resource constraints and competing priorities. This study employs participatory ethnographic methods, grounded in the transliteracies framework and a dialogic mindset, to examine how PSC interventions emerge and scale in several venture capital-funded startups in eastern upstate New York. Through a three-phase inquiry process integrating the Healthy Work Survey and Healthy Workplace Participatory Program, this research investigates barriers and facilitators to implementations of PSC interventions while analyzing how meanings and practices of psychosocial safety move across organizational interactions. The study design overcomes activation barriers by partnering with venture capital fund managers who recognize the connection between employee well-being and financial performance. Using the transliteracies analytical tools of emergence, uptake, resonance, and scale, this research aims to develop practical guidance for engaging SOs in psychosocial safety programs while advancing theoretical understanding of how organizational practices evolve through social interactions. The findings will inform more effective approaches to implementing evidence-based PSC interventions in resource-constrained environments, ultimately supporting improved employee well-being and organizational performance in the small business sector that employs nearly half of the U.S. workforce.",
            "url": "",
            "course": "CIST 608",
            "school": "University at Albany, SUNY",
            "tags": ["Organizational", "Methodology", "Social Justice"]
        },
        {
            "title": "Attention to Detail: LIS Professionals’ Role in Building AI-powered Information Retrieval Systems",
            "date": "2024-05-12",
            "abstract": "This essay examines the critical role of library and information science (LIS) professionals in the responsible implementation of artificial intelligence-powered information retrieval systems amid the convergence of big data, expanding information resources, and generative AI technologies. The study analyzes how LIS professionals can leverage their expertise in metadata management, semantic interoperability, and user-centered design to guide the ethical integration of large language models (LLMs) and generative AI tools into information systems. Through examination of Transformer architecture capabilities and limitations, the essay demonstrates that while LLMs excel at translation tasks and text generation, they lack genuine natural language understanding and operate through complex attention mechanisms rather than true knowledge construction. The analysis reveals that LIS professionals’ core competencies in controlled vocabularies, metadata standards, and knowledge organization systems position them uniquely to address quality concerns in AI-generated metadata and prevent the degradation of information access. The study emphasizes that professional values including equitable access, diversity promotion, and commitment to high-quality services make LIS professionals essential ethical leaders in LLM implementation. Key findings indicate that AI-generated metadata should supplement rather than replace expert-generated metadata, requiring careful design of generative systems and ongoing professional education about AI capabilities and limitations. The essay concludes that responsible AI adoption in library and information science requires LIS professionals to maintain focus on transforming quality information resources into accessible metadata through user-centered design while upholding professional ethical standards and engaging in collaborative education with AI system developers.",
            "url": "",
            "course": "CIST 602",
            "school": "University at Albany, SUNY",
            "tags": ["Technology", "Organizational", "Social Justice"]
        },
        {
            "title": "Bridging Informational Silos: Creating Knowledge-Sharing Ecosystems",
            "date": "2025-04-13",
            "abstract": "As artificial intelligence transforms information retrieval and knowledge management, information agency leaders are challenged to harness AI’s capabilities while preserving the dialogic processes that build shared understanding. I propose a framework for dialogic leadership that positions Library and Information Science (LIS) professionals as crucial intermediaries who can bridge technical silos through intentional knowledge-sharing ecosystems by drawing on research in organizational development, knowledge management, and information science. The framework integrates formal knowledge structures (metadata standards, AI-enhanced retrieval systems) with informal dialogic processes (collaborative learning, cross-functional communication) to address the fundamental tension between standardization and contextual understanding. This research identifies leadership strategies that successfully foster environments where structured metadata and human dialogue complement each other. Effective leaders create intentional spaces for dialogue, establish shared vocabularies across technical domains, and cultivate organizational cultures that value systematic knowledge organization and emergent understanding. In this paper, I explore how information agency leaders may deploy AI tools as catalysts of dialogue, leveraging AI capabilities with human dialogue to improve cross-functional collaboration and organizational learning.",
            "url": "",
            "course": "CIST 614",
            "school": "University at Albany, SUNY",
            "tags": ["Organizational", "Technology", "Interdisciplinary"]
        },
        {
            "title": "Unsettling Erasure: Placework and Colonial Wounds in Núuchi Country",
            "date": "2020-04-20",
            "abstract": "This essay examines the ongoing impacts of settler colonialism in Utah County through a decolonial lens, tracing connections between historical dispossession of Núuchi-u (Ute) peoples and contemporary erasure practices. The author employs placework methodology, combining archival research with embodied engagement at sites like Soónkahni Monument and the Provo River Delta to investigate how colonial narratives continue to obscure Indigenous presence and sovereignty. Historical analysis reveals how Mormon settlers’ 1849 arrival initiated systematic displacement through violence, environmental destruction, and cultural suppression, converting Núuchi Country into private property while eliminating Indigenous lifeways centered on Utah Lake’s ecosystem. The study demonstrates how contemporary restoration projects, despite ecological benefits, perpetuate colonial erasure by failing to acknowledge Indigenous histories or incorporate decolonial objectives. Drawing on theoretical frameworks from Mignolo, Howitt, and Indigenous scholars, the essay argues that healing colonial wounds requires moving beyond Western epistemological frameworks toward pluriversal thinking that recognizes multiple ways of being and knowing. The author’s experimental methodology integrates non-linear narrative structures, multilingual elements, and embodied knowledge practices to model decolonial approaches to academic discourse. Findings suggest that meaningful decolonization requires acknowledging settler privilege, centering Indigenous voices, and transforming dominant power structures rather than simply adding Indigenous perspectives to existing colonial frameworks. The essay concludes that authentic coexistence demands fundamental changes in how settlers understand their relationship to land, history, and Indigenous peoples, moving from being-together-in-place toward belonging-together-in-Country through sustained placework and decolonial praxis.",
            "url": "https://rfugal-misc.s3.amazonaws.com/Capstone.pdf",
            "course": "WRTG 5990",
            "school": "University of Utah",
            "tags": ["Indigenous Studies", "Colonial Studies", "Environmental"]
        }
    ]
}